In [ ]:
# Creating dataframe alongwith column names
import pandas as pd
data = [['Raj',11],['Rahul',22],['Simran',53]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0     Raj   11
1   Rahul   22
2  Simran   53

In [ ]:
df.shape

(3, 2)

In [ ]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [ ]:
df['Name']

0       Raj
1     Rahul
2    Simran
Name: Name, dtype: object

In [ ]:
df['Age'].min()

11

In [ ]:
df['Age'].max()

53

In [ ]:
df.describe()

             Age
count   3.000000
mean   28.666667
std    21.779195
min    11.000000
25%    16.500000
50%    22.000000
75%    37.500000
max    53.000000

In [ ]:
df.Age>10

0    True
1    True
2    True
Name: Age, dtype: bool